"""
Задача 1. Система рейтинга продуктов
На писать программу, которая по числовому рейтингу (от 1 до 10) выводит:
Текстовое описание (отличный, хороший, средний, плохой)
Соответствующий emoji
Рекомендацию (рекомендую, можно попробовать, не рекомендую)

Требование: Использовать case с объединением значений через |.
"""

print("Вас приветствует программа, которая по числовому рейтингу (от 1 до 10) выводит: Текстовое описание (отличный, хороший, средний, плохой).")

try:
    grade = int(input("Введите Ваш числовой рейтинг = "))
except ValueError:
    print("Введите значение целым числом!")
    exit()

match grade:
     case 1|2|3|4:
         print(f"Рейтинг {grade} -> Плохой продукт! 🤬 Не рекомендую!!!!!")
     case 5|6|7|8:
         print(f"Рейтинг {grade} -> Средний продукт. 🤨 Можно попробовать.")
     case 9|10:
         print(f"Рейтинг {grade} -> Отличный продукт! 💫 Настоятельно рекомендую!")
     case _:
         print("Введите значение в диапазоне от 1 до 10!")
