"""
Задача 2. Система статусов заказов
Написать программу «Отслеживание заказа», которая по введенному коду
статуса заказа выводит детальное описание текущего статуса, соответствующий emoji и примерное время обработки.

Входные данные
Строка, содержащая один из следующих статусов:
"pending" (в ожидании)
"processing" (в обработке)
"shipped" (отправлено)
"delivered" (доставлено)
"cancelled" (отменено)

Выходные данные
Красиво отформатированная информация о статусе заказа:
Статус на русском языке
Описание этапа
Соответствующий emoji
Примерное время ожидания (random)

Пример выполнения

вывод с оформлением в конце с подстановкой второй переменной, в которой уже будет ответ?
"""

print("Вас приветствует программа «Отслеживание заказа», которая по введенному коду статуса заказа \n"
"выводит детальное описание текущего статуса, соответствующий emoji и примерное время обработки.")

order_status = str(input("Введите статус Вашего заказа (без кавычек) = "))


def layout_form():
    WIDTH = 50
    print("╔" + "═" * WIDTH + "╗")
    print("║" + "СТАТУС ВАШЕГО ЗАКАЗА".center(WIDTH) + "║")
    print("╚" + "═" * WIDTH + "╝")


def status_pending():
    layout_form()
    print(f"Статус: {order_status} (в ожидании ⏳)")
    print("Описание: Ваш заказ принят и ожидает подтверждения 📝")
    print("Примерное время: до 24 часов 🕐")
    print("Рекомендация: Проверьте, что оплата прошла успешно 👀")


def status_processing():
    layout_form()
    print(f"Статус: {order_status} (обработке 📦)")
    print("Описание: Ваш заказ собирается и упаковывается на складе 📝")
    print("Примерное время: до 3 дней 🕐")
    print("Рекомендация: Убедитесь, что адрес доставки указан верно 👀")


def status_shipped():
    layout_form()
    print(f"Статус: {order_status} (Отправлено ✈️)")
    print("Описание: Ваш заказ находится в пути к вам 📝")
    print("Примерное время: до 5 дней 🕐")
    print("Рекомендация: Следите за уведомлениями о доставке 👀")


def status_delivered():
    layout_form()
    print(f"Статус: {order_status} (Доставлено ✅)")
    print("Описание: Ваш заказ доставлен и вручён получателю 📝")
    print("Примерное время: заказ уже у вас ✅")
    print("Рекомендация: Проверьте комплектацию и сохраните чек на случай возврата 👀")


def status_cancelled():
    layout_form()
    print(f"Статус: {order_status} (Отменено ❌)")
    print("Описание: Заказ был отменён, дальнейшая обработка не производится 📝")
    print("Примерное время: ❌")
    print("Рекомендация: Если вы не отменяли заказ, свяжитесь со службой поддержки 🤙")


match order_status:
    case "pending": status_pending()
    case "processing": status_processing()
    case "shipped": status_shipped()
    case "delivered": status_delivered()
    case "cancelled": status_cancelled()
    case _:
        print("❌ Ошибка: Неизвестный статус \"invalid_status\" ")
        print("Доступные статусы: pending, processing, shipped, delivered, cancelled")

