# Задание 4
#1.  Хранение текущего количества студентов в группе. INT
#2.  Хранение температуры в градусах Цельсия (например, 23.5). FLOAT
#3.  Хранение логина пользователя (например, "ivanov_ivan"). STR
#4.  Хранение информации о том, включено ли уведомление (да/нет). BOOL
#5.  Хранение списка любимых фильмов. LIST
#6.  Хранение координат точки в 2D пространстве (x, y), которые не должны изменяться после задания. TUPLE
#7.  Хранение уникальных ID товаров в корзине покупок. SET
#8.  Хранение соответствия между названием страны и её столицей. DICT