"""Задача 2. Цвета колеса рулетки
На колесе рулетки карманы пронумерованы от 0 до 36.
Ниже приведены цвета карманов:
1. карман 0 – зеленый;
2. для карманов с 1 по 10 карманы с нечётным номером имеют красный цвет, карманы с чётным номером – черный;
3. для карманов с 11 по 18 карманы с нечётным номером имеют черный цвет, карманы с чётным номером – красный;
4. для карманов с 19 по 28 карманы с нечётным номером имеют красный цвет, карманы с чётным номером – черный;
5. для карманов с 29 по 36 карманы с нечётным номером имеют черный цвет, карманы с чётным номером – красный.

Напишите программу, которая считывает номер кармана и показывает, является ли этот карман зеленым, красным или черным.
Программа должна вывести сообщение об ошибке, если пользователь вводит число, которое лежит вне диапазона от 0 до 36.

Формат входных данных
На вход программе подаётся одно целое число.

Формат выходных данных
Программа должна вывести цвет кармана либо сообщение «ошибка ввода» (без кавычек), если введённое число лежит вне диапазона от 0 до 36.
"""
#3 блока для двух переменных, так как: 1 блок про зеро, 2 блок берет 2 и 4 условие из задачи, так как цвета для четных/нечетных карманов одинаковые
#(И так же с 3 и 5)
print("Вас приветствует программа, которая считывает номер кармана и показывает, является ли этот карман зеленым, красным или черным!")
try:
    pocket_number = int(input("Ваш номер кармана = "))
except ValueError:
    print("Введите целое число!!!")
    exit()

# Первый блок: карман 0 – зеленый;
if pocket_number == 0:
    print("Цвет кармана - зеленый!")

#2 и 4 (сперва четные номера потом нечетные), 2 блока получается
elif (1 <= pocket_number <= 10 or 19 <= pocket_number <= 28) and \
    pocket_number % 2 == 0:
    print("Цвет кармана - черный!")
elif (1 <= pocket_number <= 10 or 19 <= pocket_number <= 28) and \
    not pocket_number % 2 == 0:
    print("Цвет кармана - красный!")

#3 и 5 по аналогии
elif (11 <= pocket_number <= 18 or 29 <= pocket_number <= 36) and \
    pocket_number % 2 == 0:
    print("Цвет кармана - красный!")
elif (11 <= pocket_number <= 18 or 29 <= pocket_number <= 36) and \
    not pocket_number % 2 == 0:
    print("Цвет кармана - черный!")

#И если значение не попало в диапазон
else:
    print("Ваше значение вне диапазона!!!")
